Revit 2021.1 API
UnitFormatUtils.TryParse Method (Units, ForgeTypeId, String, Double)
 Parses a formatted string into a number with units if possible.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2014
Syntax
C#
public static bool TryParse(
	Units units,
	ForgeTypeId specTypeId,
	string stringToParse,
	out double value
)
Visual Basic
Public Shared Function TryParse ( _
	units As Units, _
	specTypeId As ForgeTypeId, _
	stringToParse As String, _
	<OutAttribute> ByRef value As Double _
) As Boolean
Visual C++
public:
static bool TryParse(
	Units^ units,
	ForgeTypeId^ specTypeId,
	String^ stringToParse,
	[OutAttribute] double% value
)
Parameters
units
Type: Autodesk.Revit.DB.Units
 The units formatting settings, typically obtained from Document.GetUnits().
specTypeId
Type: Autodesk.Revit.DB.ForgeTypeId
 Identifier of the target spec for the value.
stringToParse
Type: System.String
 The string to parse.
value
Type: System.Double
 The parsed value. Ignore this value if the function returns false.
Return Value
 True if the string can be parsed, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  specTypeId is not a spec identifier. See UnitUtils.IsSpec(ForgeTypeId) and UnitUtils.GetSpecTypeId(UnitType).
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
UnitFormatUtils Class
TryParse Overload
Autodesk.Revit.DB Namespace